First_routes/app/controllers/artworks_controller.rb

UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "t10"], ["updated_at", "2018-12-17 22:35:33.305624"], ["id", 7]]
---
    def update
        artwork = Artwork.update(params[:id], artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def destroy
        artwork = Artwork.find_by(id: params[:id])