First_routes/app/controllers/users_controller.rb

   def update
        user = User.update(params[:id], user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Jason"], ["email", "j@gmail.com"], ["updated_at", "2018-12-17 20:08:27.389610"], ["id", 3]]

   def destroy
    user = User.find_by(id: params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]